tap "antoniorodr/memo"
tap "steipete/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq", link: true
# AI coding agent, built for the terminal
brew "opencode"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Watch files and take action when they change
brew "watchman"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# CLI app to manage your Apple Notes and Apple reminders
brew "antoniorodr/memo/memo"
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"
# Lightning-fast macOS screenshots & AI vision analysis
brew "steipete/tap/peekaboo"
# WhatsApp CLI built on whatsmeow
brew "steipete/tap/wacli"
# Command-line interface for 1Password
cask "1password-cli"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
